# GetClUseGraphic

## Description
Returns whether the graphic attributes of the specified class will be used at object creation.

```pascal
FUNCTION GetClUseGraphic(className : STRING): BOOLEAN;
```

```python
def vs.GetClUseGraphic(className):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Name of class.|

## Remarks
Returns whether the class is set to use its graphic attributes at object creation.

## Version
Availability: from VectorWorks8.0

## Category
* Classes